# StairsDbgShowMonolithicSupportCorseGeom Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..StairsDbgShowMonolithicSupportCorseGeom Property
ParameterTypeId Class See Also
---
"Show Monolithic Support Corse Geometry"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId StairsDbgShowMonolithicSupportCorseGeom { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property StairsDbgShowMonolithicSupportCorseGeom As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ StairsDbgShowMonolithicSupportCorseGeom {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace